# Используем базовый образ Python
FROM python:3.9-slim

# Сохраняем токен
ENV TOKEN='7706774012:AAFlp4Z3rA2dqUgzkjLuFzFEnOJc8niwvdc'

# Устанавливаем рабочую директорию
WORKDIR /Users/vladislavkravchenko/Desktop/WORK_IT/1.Elbrus_Bootcamp/2.Phase0/3.Week_3/1.Monday/HW/app

# Копируем содержимое проекта
COPY . .

# Устанавливаем зависимости
RUN pip install -r requirements.txt

# Задаем основную команду
ENTRYPOINT ["python", "bot.py"]

# Запускаем приложение
# CMD ["python", "main.py"]

# Основные различия:
# 	•	CMD можно легко переопределить при запуске контейнера, тогда как ENTRYPOINT всегда будет выполняться.
# 	•	ENTRYPOINT используется для выполнения фиксированной команды, которая должна быть неизменной, а CMD — для задания команды по умолчанию, которую можно заменить.
# Когда использовать CMD:
# 	•	Когда хотите задать команду по умолчанию, но хотите оставить возможность ее переопределить при запуске контейнера.
# Когда использовать ENTRYPOINT:
# 	•	Когда контейнер должен всегда выполнять одну и ту же команду независимо от аргументов, предоставленных при запуске.